### Basic Analytics with Pandas

#### Mean, median and mode
#### Variance, standard deviation
#### Skewness. kurtosis

#### Datasets Required
1. annual-motor-vehicle-population-by-vehicle-type.csv (Data.gov.sg)
2. graduate-employment-survey.csv (Singstat)

All datasets are downloaded from data.gov.sg

### Import Pandas

In [2]:
import pandas as pd

### Read CSV into dataframe

In [5]:
df = pd.read_csv('annual-motor-vehicle-population-by-vehicle-type.csv')

### Practice displaying the first 5 records in the dataframe

In [6]:
df.head()

   year               category          type  number
0  2005  Cars & Station-wagons  Private cars  401638
1  2006  Cars & Station-wagons  Private cars  421904
2  2007  Cars & Station-wagons  Private cars  451745
3  2008  Cars & Station-wagons  Private cars  476634
4  2009  Cars & Station-wagons  Private cars  497116

### Summary of dataframe statistics

Use .describe() to retrieve a summary of each of the columns in the dataframe.

The 25%, 50% and 75% are the percentiles respectively.

In [7]:
df.describe()

              year         number
count   260.000000     260.000000
mean   2011.000000   45846.419231
std       3.748874  109181.988385
min    2005.000000     274.000000
25%    2008.000000    2413.250000
50%    2011.000000    7636.500000
75%    2014.000000   28222.250000
max    2017.000000  540063.000000

#### Categorical fields

You can also describe a `selected column` that is a categorical field. In the dataset provided, the type of vehicles is a categorical field. Use df['type'].describe() to get details about type.

In [5]:
df['type'].describe()

count             260
unique             23
top       Motorcycles
freq               24
Name: type, dtype: object

#### Unique values

To get all unique values in a dataframe, use SERIES.unique(). 

Reminder: A column extracted from a dataframe is called a series. Practice getting all unique vehicle types.

In [7]:
df['type'].unique()

array(['Private cars', 'Company cars', 'Tuition cars', 'Rental cars',
       'Off peak cars', 'Taxis', 'Motorcycles',
       'Goods-cum-passenger vehicles (GPVs)',
       'Light Goods Vehicles (LGVs)', 'Heavy Goods Vehicles (HGVs)',
       'Very Heavy Goods Vehicles (VHGVs)', 'Omnibuses',
       'School buses (CB)', 'Private buses', 'Private hire buses',
       'Excursion buses', 'Cars & Station-wagons', 'Buses',
       'Goods & Other Vehicles', 'Motorcycles and Scooters',
       'Cars and Station-wagons', 'Motorcycles and scooters',
       'Goods and Other Vehicles'], dtype=object)

#### Additional unique functions

Find the number of unique values with .nunique()

This can also be done with the .len() function by measuring the length of the array obtained from .unique() above.

In [9]:
print(df['type'].nunique())

print ('-----------------')

print(len(df['type'].unique()))

23
-----------------
23

##### .value_counts() provides a count of each unique item in the series

In [11]:
df['type'].value_counts()

Motorcycles                            24
Taxis                                  13
Tuition cars                           13
School buses (CB)                      13
Rental cars                            13
Very Heavy Goods Vehicles (VHGVs)      13
Omnibuses                              13
Off peak cars                          13
Excursion buses                        13
Buses                                  13
Private buses                          13
Goods-cum-passenger vehicles (GPVs)    13
Company cars                           13
Private cars                           13
Light Goods Vehicles (LGVs)            13
Private hire buses                     13
Heavy Goods Vehicles (HGVs)            13
Goods & Other Vehicles                 12
Cars & Station-wagons                  12
Cars and Station-wagons                 1
Motorcycles and scooters                1
Motorcycles and Scooters                1
Goods and Other Vehicles                1
Name: type, dtype: int64


### Dataframe aggregation

### groupby()

By using `groupby()`, you will get a `DataframeGroupBy` object.
The `DataframeGroupBy` object is used for obtaining a unique column. You can aggregate the data afterwards with other functions such as count() or sum() etc.

First, create a groupby object for 'category' from the overall df.

In [25]:
df_groupby = df.groupby('category')
df_groupby

#### Utilizing functions with groupby()

Use the functions `count()` and `size()` and examine the results.

- `count()` provides a count of the number of the other columns filled.
- `size()` is used to find the number of pokemon belonging to each `category` in our case.

In [28]:
df_groupby.count()
# df_groupby.size()

                          year  type  number
category
Buses                       65    65      65
Cars & Station-wagons       60    60      60
Cars and Station-wagons      5     5       5
Goods & Other Vehicles      48    48      48
Goods and Other Vehicles     4     4       4
Motorcycles                 12    12      12
Motorcycles and Scooters     1     1       1
Tax Exempted Vehicles       52    52      52
Taxis                       13    13      13

Use the function `max()` and `min()`

##### Obtain the highest number of each of the vehicle categories over the years.

First, create a copy of the df to only include category and number.

Then, create a groupby object with 'category', since we want the vehicle category. 

Afterwards, use the `max()` function to obtain the highest number. Use the `min()` function to obtain the lowest number.

In [44]:
df_veh = df.copy()
df_veh = df_veh[['category','number']]

df_veh_groupby = df_veh.groupby('category')
df_veh_groupby.max()
# df_veh_groupby.min()

                          number
category
Buses                       7517
Cars & Station-wagons     540063
Cars and Station-wagons   502187
Goods & Other Vehicles     95750
Goods and Other Vehicles   94724
Motorcycles               147282
Motorcycles and Scooters  141304
Tax Exempted Vehicles      19855
Taxis                      28736



#### Obtaining the basic analytical details

##### First, create a dataframe with type == Motorcycles

In [13]:
df2 = df.copy()
condition = df2['type']=='Motorcycles'
df2 = df2[condition]
df2

     year               category         type  number
60   2005            Motorcycles  Motorcycles  138588
61   2006            Motorcycles  Motorcycles  141881
62   2007            Motorcycles  Motorcycles  143482
63   2008            Motorcycles  Motorcycles  145288
64   2009            Motorcycles  Motorcycles  146337
65   2010            Motorcycles  Motorcycles  147282
66   2011            Motorcycles  Motorcycles  145680
67   2012            Motorcycles  Motorcycles  143286
68   2013            Motorcycles  Motorcycles  144307
69   2014            Motorcycles  Motorcycles  144404
170  2005  Tax Exempted Vehicles  Motorcycles     846
171  2006  Tax Exempted Vehicles  Motorcycles     855
172  2007  Tax Exempted Vehicles  Motorcycles     858
173  2008  Tax Exempted Vehicles  Motorcycles     832
174  2009  Tax Exempted Vehicles  Motorcycles     878
175  2010  Tax Exempted Vehicles  Motorcycles     878
176  2011  Tax Exempted Vehicles  Motorcycles     879
177  2012  Tax Exempted Vehicles  Motorcycles     824
178  2013  Tax Exempted Vehicles  Motorcycles     627
179  2014  Tax Exempted Vehicles  Motorcycles     622
206  2015            Motorcycles  Motorcycles  143279
217  2015  Tax Exempted Vehicles  Motorcycles     621
226  2016            Motorcycles  Motorcycles  142439
237  2016  Tax Exempted Vehicles  Motorcycles     613

### Sum, min, max.

The .sum(), .min(), .max() functions. Self explanatory.

The .count() function counts the number of records inside a series.

Practice on the `number` of motorcycles in the newly created dataframe.

In [15]:
print(df2['number'].sum())
print('----------')
print(df2['number'].min())
print('----------')
print(df2['number'].max())
print('----------')
print(df2['number'].count())

1735586
----------
613
----------
147282
----------
24

### Mean, median, mode.

The .mean(), .median(), .mode() functions. Self explanatory.

Practice on the `number` of motorcycles in the newly created dataframe.

In [16]:
print(df2['number'].mean())
print('----------')
print(df2['number'].median())
print('----------')
print(df2['number'].mode())

72316.08333333333
----------
69733.5
----------
0    878
dtype: int64

### Variance, Standard Deviation

The .var(), .std() functions. Self explanatory

In [17]:
print(df2['number'].var())
print('----------')
print(df2['number'].std())

5342781679.036232
----------
73094.33411035518

### Skewness

The results highlights whether the dataset is left-tailed or right-tailed. If the dataset is left-tailed, then more datapoints are higher than the mean. If the dataset is right-tailed, more datapoints are lower than the mean.

Interpret the skewness as follows:

- If the skewness is  0  then the observations are symmetrical.
- If the skewness is positive  (>0)  then the dataset is skewed right (right-tailed).
- If the skewness is negative  (<0) then the dataset is left-skewed (left-tailed).

Use .skew() to find the skewness.

In [18]:
print(df2['number'].skew())

0.001502728107427262

### Kurtosis

This will mean how heavy the tails are, compared to a normal distribution.

Compared to a (fitted) normal distribution, if the observations have excessively `fat` tails, the kurtosis is positive. The kurtosis of a normal distribution is  0. If the observations a very light tail, then the kurtosis is negative.

Use .kurt() to find the kurtosis score.

In [19]:
print(df2['number'].kurt())

-2.1881625484817704

### Another dataset

Practice getting the mean, median, skewness on this dataset. 
`graduate-employment-survey.csv`

In [11]:
df_new = pd.read_csv('graduate-employment-survey.csv')
print(df_new.describe())
print('---------------')
print(df_new['gross_monthly_median'].skew())

              year  gross_monthly_median
count   513.000000            513.000000
mean   2015.159844           3347.832359
std       1.374213            500.829744
min    2013.000000           2225.000000
25%    2014.000000           3005.000000
50%    2015.000000           3295.000000
75%    2016.000000           3500.000000
max    2017.000000           5800.000000
---------------
1.6795741836698306